import React from 'react';

const Work = () => {
    return (
        <div>
            <h1>How react works?</h1>
            <p> Answer:একটি প্রতিক্রিয়া অ্যাপ্লিকেশন একাধিক উপাদান দিয়ে তৈরি, প্রতিটি HTML এর একটি ছোট, পুনঃব্যবহারযোগ্য অংশ রেন্ডার করার জন্য দায়ী। সাধারণ বিল্ডিং
 ব্লকগুলির মধ্যে জটিল অ্যাপ্লিকেশনগুলি তৈরি করার অনুমতি দেওয়ার জন্য উপাদানগুলি অন্যান্য উপাদানগুলির মধ্যে নেস্ট করা যেতে পারে।
 একটি উপাদান একটি অভ্যন্তরীণ অবস্থা বজায় রাখতে পারে - উদাহরণস্বরূপ,
 একটি ট্যাবলিস্ট উপাদান বর্তমানে খোলা ট্যাবের সাথে সম্পর্কিত একটি পরিবর্তনশীল সংরক্ষণ করতে পারে।

প্রতিক্রিয়া একটি কাঠামো নয়। এটি শুধুমাত্র একটি লাইব্রেরি যা ফেসবুক দ্বারা কিছু সমাধান করার জন্য তৈরি করা হয়েছে</p>
        </div>
    );
};

export default Work;